// 1.Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

let str = '';
for (let i = 20; i <= 30; i=i+0.5) {
    str += i + ' ';
}
console.log(str.trim());

// 2.Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

let price = [];
for (let i = 10; i <= 100; i = i + 10) {
    price.push(i * 27);


}

console.log(price);

// 3. Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
let n = +prompt("Введить ціле число");
let arr = [];
for(let i = 1; i <= 100; i++) {
    if(Math.pow(i, 2) < n) {
        arr.push(i);
    }
}

console.log(arr);


// 4.Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1,
// які не мають інших дільників крім 1 і себе).

let x = +prompt("Введить ціле число більш одиниці");
for (let i = 2; i <= x; i++) {
    if(x % i === 0) {
        console.log("Число не є простим");

    } else {
        console.log("Число є простим");
    }
}

// 5.Дане деяке число. Визначити, чи можна одержати це число шляхом
// зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

let number = parseInt(prompt("Введить щоб перевірити чи можна отримати число з трійки в деякий ступені"));
let result = 0;
let degree = 1;
while (result < number) {
    degree++;
    result = Math.pow(3, degree);
}
if(result === number) {
    console.log("Можно отримати")
} else
{console.log("Не можна отримати")}
